{
  "knowledge": [
    {
      "name": {
        "fr": "Git / GitHub",
        "en": "Git / GitHub"
      },
      "description": {
        "fr": "Logiciel et plateforme de gestion de versions décentralisé, utilisé pour le développement de logiciels.",
        "en": "Decentralized version management software and platform, used for software development."
      },
      "icon": "github"
    },
    {
      "name": {
        "fr": "HTML",
        "en": "HTML"
      },
      "description": {
        "fr": "Langage de balisage utilisé pour la création de pages web, en particulier leur structure.",
        "en": "Markup language used for the creation of web pages, especially their structure."
      },
      "icon": "html"
    },
    {
      "name": {
        "fr": "CSS",
        "en": "CSS"
      },
      "description": {
        "fr": "Langage de style utilisé pour la mise en forme de pages web, en particulier leur style.",
        "en": "Style language used for the formatting of web pages, especially their style."
      },
      "icon": "css"
    },
    {
      "name": {
        "fr": "JavaScript",
        "en": "JavaScript"
      },
      "description": {
        "fr": "Langage utilisé pour l'animation et le fonctionnement de pages web, ainsi que pour les serveurs NodeJS notamment.",
        "en": "Language used for the animation and operation of web pages, as well as for NodeJS servers in particular."
      },
      "icon": "javascript"
    },
    {
      "name": {
        "fr": "MongoDB",
        "en": "MongoDB"
      },
      "description": {
        "fr": "Base de données NoSQL orientée documents, utilisée pour le stockage de données.",
        "en": "Document-oriented NoSQL database, used for data storage."
      },
      "icon": "mongodb"
    },
    {
      "name": {
        "fr": "NodeJS / ExpressJS",
        "en": "NodeJS / ExpressJS"
      },
      "description": {
        "fr": "Environnement d'exécution JavaScript côté serveur, utilisé pour le développement d'applications web.",
        "en": "JavaScript runtime environment on the server side, used for the development of web applications."
      },
      "icon": "nodejs"
    },
    {
      "name": {
        "fr": "React",
        "en": "React"
      },
      "description": {
        "fr": "Framework développé par Facebook / Meta, fonctionnant avec un système de composants réutilisables.",
        "en": "Framework developed by Facebook / Meta, using a system of reusable components."
      },
      "icon": "react"
    },
    {
      "name": {
        "fr": "SEO",
        "en": "SEO"
      },
      "description": {
        "fr": "Optimisation pour les moteurs de recherche, utilisée pour améliorer le référencement d'un site web.",
        "en": "Search engine optimization, used to improve the SEO of a website."
      },
      "icon": "seo"
    },
    {
      "name": {
        "fr": "Optimisation",
        "en": "Optimization"
      },
      "description": {
        "fr": "Optimisation de code, utilisée pour améliorer les performances d'un site web.",
        "en": "Code optimization, used to improve the performance of a website."
      },
      "icon": "opti"
    }
  ],

  "softSkills": {
    "autonomy": {
      "name": {
        "fr": "Autonomie",
        "en": "Autonomy"
      },
      "description": {
        "fr": "Aisance à travailler seul, sans ou avec peu de supervision.",
        "en": "Ease of working alone, without or with little supervision."
      },
      "icon": "autonomy"
    },
    "teamwork": {
      "name": {
        "fr": "Travail d'équipe",
        "en": "Teamwork"
      },
      "description": {
        "fr": "Capacité à travailler en équipe, en collaboration avec d'autres collaborateurs.",
        "en": "Ability to work in a team, in collaboration with other employees."
      },
      "icon": "teamwork"
    },
    "communication": {
      "name": {
        "fr": "Communication",
        "en": "Communication"
      },
      "description": {
        "fr": "Capacité à communiquer avec d'autres personnes, à l'écrit comme à l'oral.",
        "en": "Ability to communicate with other people, in writing and orally."
      },
      "icon": "communication"
    },
    "adaptability": {
      "name": {
        "fr": "Adaptabilité",
        "en": "Adaptability"
      },
      "description": {
        "fr": "Capacité à m'adapter à de nouvelles situations, à de nouveaux environnements.",
        "en": "Ability to adapt to new situations, to new environments."
      },
      "icon": "adaptability"
    },
    "curiosity": {
      "name": {
        "fr": "Curiosité / Veille",
        "en": "Curiosity / Watch"
      },
      "description": {
        "fr": "Capacité à m'intéresser à de nouveaux sujets, à de nouvelles technologies.",
        "en": "Ability to be interested in new subjects, new technologies."
      },
      "icon": "curiosity"
    },
    "creativity": {
      "name": {
        "fr": "Créativité",
        "en": "Creativity"
      },
      "description": {
        "fr": "Entrain à trouver des solutions originales à des problèmes.",
        "en": "Ability to find original solutions to problems."
      },
      "icon": "creativity"
    },
    "organization": {
      "name": {
        "fr": "Organisation",
        "en": "Organization"
      },
      "description": {
        "fr": "Capacité à m'organiser, à planifier des tâches.",
        "en": "Ability to organize, to plan tasks."
      },
      "icon": "organization"
    },
    "english": {
      "name": {
        "fr": "Anglais",
        "en": "English"
      },
      "description": {
        "fr": "Capacité à comprendre et à m'exprimer en anglais.",
        "en": "Ability to understand and express myself in English."
      },
      "icon": "english"
    }
  }
}
